Revit 2026 API

# gbXMLBuildingHVACSystem Enumeration

---

Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum gbXMLBuildingHVACSystem
```
```vb
Public Enumeration gbXMLBuildingHVACSystem
```
```cpp
public enum class gbXMLBuildingHVACSystem
```
```fsharp
type gbXMLBuildingHVACSystem
```

| Member name | Value | Description |
| --- | --- | --- |
| CentralVAVElectricResistanceHeatChillerFivePointNinetySixCOP | 4 |  |
| CentralVAVHWHeatChillerFivePointNinetySixCOPBoilersEightyFourPoint5Eff | 2 |  |
| ElevenPointThreeEERPackagedVAVEightyFourPointFourPercentBoilerHeating | 1 |  |
| FourPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightFourPointFiveEff | 3 |  |
| NoOfHVACSystemEnums | 12 |  |
| ResidentialFourteenSEEREightPointThreeHSPFSplitPackagedHeatPump | 11 |  |
| ResidentialFourteenSEERPointNineAFUESplitPackagedGasLessThanFivePointFiveTon | 10 |  |
| ResidentialSeventeenSEERNinePointSixHSPFSplitHPLessThanFivePointFiveTon | 8 |  |
| TwelveSEEREightPointThreeHSPFPackagedTerminalHeatPumpPTAC | 7 |  |
| TwelveSEERSevenPointSevenHSPFSplitPackagedHeatPump | 5 |  |
| TwelveSEERSPointNineAFUESplitPackagedGasFiveToElevenTon | 0 |  |
| TwoPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightyFourPointFiveEff | 6 |  |
| UnderfloorAirDistribution | 9 |  |

This enumeration corresponds to the HVAC System attribute in gbXML and is used to specify the Building HVAC System.

#### Reference

Autodesk.Revit.DB.Analysis Namespace